adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- File naming: <vendor>_<part/series name>_svd.xml -->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Nordic Semiconductor</vendor>
  <vendorID>Nordic</vendorID>
  <name>nrf9160_modem</name>
  <series>nrf91</series>
  <version>1</version>
  <description>nrf9160 modem reference description for radio MCU with ARM 32-bit Cortex-M4 Microcontroller </description>
  <licenseText>
Copyright (c) 2010 - 2020, Nordic Semiconductor ASA\n
\n
All rights reserved.\n
\n
Redistribution and use in source and binary forms, with or without modification,\n
are permitted provided that the following conditions are met:\n
\n
1. Redistributions of source code must retain the above copyright notice, this\n
   list of conditions and the following disclaimer.\n
\n
2. Redistributions in binary form, except as embedded into a Nordic\n
   Semiconductor ASA integrated circuit in a product or a software update for\n
   such product, must reproduce the above copyright notice, this list of\n
   conditions and the following disclaimer in the documentation and/or other\n
   materials provided with the distribution.\n
\n
3. Neither the name of Nordic Semiconductor ASA nor the names of its\n
   contributors may be used to endorse or promote products derived from this\n
   software without specific prior written permission.\n
\n
4. This software, with or without modification, must only be used with a\n
   Nordic Semiconductor ASA integrated circuit.\n
\n
5. Any software provided in binary form under this license must not be reverse\n
   engineered, decompiled, modified and/or disassembled.\n
\n
THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS\n
OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\n
OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE\n
DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE\n
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE\n
GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n
HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n
LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT\n
OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n
        </licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <cpu>
    <name>CM4</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>1</mpuPresent>
    <fpuPresent>1</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>0</vendorSystickConfig>
  </cpu>
  <headerSystemFilename>system_nrf9160_modem</headerSystemFilename>
  <headerDefinitionsPrefix>NRF_</headerDefinitionsPrefix>
  <vendorExtensions>
    <MaxInterrupts>240</MaxInterrupts>
  </vendorExtensions>
  <peripherals>
    <peripheral>
      <name>FICR_NS</name>
      <description>Factory Information Configuration Registers</description>
      <baseAddress>0x00FF0000</baseAddress>
      <headerStructName>FICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>FICR</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TESTSTATUS</name>
          <description>Code memory test status. Will be set during production test.</description>
          <addressOffset>0x100</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>TESTSTATUS</name>
              <description>Code memory test status. Will be set during production test.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST0</name>
          <description>Result from Circuit Probe test</description>
          <addressOffset>0x104</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CP1</name>
              <description>Result from Circuit Probe test</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST00</name>
          <description>Result from Circuit Probe test</description>
          <addressOffset>0x108</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CP2</name>
              <description>Result from Circuit Probe test</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST1</name>
          <description>Result from Circuit Probe test</description>
          <addressOffset>0x110</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>LOTID1</name>
              <description>1st ascii byte of Lot ID character</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>LOTID2</name>
              <description>2nd ascii byte of Lot ID character</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>LOTID3</name>
              <description>3rd ascii byte of Lot ID character</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>LOTID4</name>
              <description>4th ascii byte of Lot ID character</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST2</name>
          <description>Result from Circuit Probe test</description>
          <addressOffset>0x114</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>LOTID5</name>
              <description>5th ascii byte of Lot ID character</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>LOTID6</name>
              <description>6th ascii byte of Lot ID character</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>WAFER</name>
              <description>Wafer number, 1 byte integer</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>XCOORD</name>
              <description>Device X-coordinate, always &amp;gt;=0, offset so that the leftmost value on wafer is 0</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST3</name>
          <description>Result from Circuit Probe test</description>
          <addressOffset>0x118</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>YCOORD</name>
              <description>Device Y-coordinate, always &amp;gt;=0, offset so that the bottom value on wafer is 0</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>DR1</name>
              <description>Data Retention (DR) flag</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>DR2</name>
              <description>Data Retention (DR) flag</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>DR3</name>
              <description>Data Retention (DR) flag</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST4</name>
          <description>Result from Circuit Probe test</description>
          <addressOffset>0x11C</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DR4</name>
              <description>Data Retention (DR) flag</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST5</name>
          <description>Result from Circuit Probe test, flash repair information</description>
          <addressOffset>0x120</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CPTEST5</name>
              <description>flash repair information</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST6</name>
          <description>Result from Circuit Probe test, flash repair information</description>
          <addressOffset>0x124</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CPTEST6</name>
              <description>flash repair information</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST7</name>
          <description>Result from Circuit Probe test, flash repair information</description>
          <addressOffset>0x128</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CPTEST7</name>
              <description>flash repair information</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTEST8</name>
          <description>Result from Circuit Probe test, flash repair information</description>
          <addressOffset>0x12C</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CPTEST8</name>
              <description>flash repair information</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>INFO</name>
          <description>Device info</description>
          <headerStructName>FICR_INFO</headerStructName>
          <access>read-write</access>
          <addressOffset>0x200</addressOffset>
          <register>
            <name>CONFIGID</name>
            <description>Configuration identifier</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>HWID</name>
                <description>Identification number for the HW</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>FWID</name>
                <description>Deprecated field -  Identification number for the FW that is pre-loaded into the chip</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DEVICEID[%s]</name>
            <description>Description collection: Device identifier</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>DEVICEID</name>
                <description>64 bit unique device identifier</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PART</name>
            <description>Part code</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00009120</resetValue>
            <fields>
              <field>
                <name>PART</name>
                <description>Part code</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VARIANT</name>
            <description>Part Variant, Hardware version and Production configuration</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0x43434141</resetValue>
            <fields>
              <field>
                <name>VARIANT</name>
                <description>Part Variant, Hardware version and Production configuration, encoded as ASCII</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKAGE</name>
            <description>Package option</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <resetValue>0x00009001</resetValue>
            <fields>
              <field>
                <name>PACKAGE</name>
                <description>Package option</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RAM</name>
            <description>RAM variant</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <resetValue>0x0000032C</resetValue>
            <fields>
              <field>
                <name>RAM</name>
                <description>RAM variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH</name>
            <description>Flash variant</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000A00</resetValue>
            <fields>
              <field>
                <name>FLASH</name>
                <description>Flash variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CODEPAGESIZE</name>
            <description>Code memory page size</description>
            <addressOffset>0x020</addressOffset>
            <access>read-only</access>
            <resetValue>0x00002000</resetValue>
            <fields>
              <field>
                <name>CODEPAGESIZE</name>
                <description>Code memory page size</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CODESIZE</name>
            <description>Code memory size</description>
            <addressOffset>0x024</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000138</resetValue>
            <fields>
              <field>
                <name>CODESIZE</name>
                <description>Code memory size in number of pages</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEVICETYPE</name>
            <description>Device type</description>
            <addressOffset>0x028</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DEVICETYPE</name>
                <description>Device type</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Die</name>
                    <description>Device is an physical DIE</description>
                    <value>0x0000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FPGA</name>
                    <description>Device is an FPGA</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
