adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem.svd
        <register>
          <name>CHIPCONF02</name>
          <description>Miscellaneous modem HW configuration. Will be set during production test.</description>
          <addressOffset>0x248</addressOffset>
          <access>read-only</access>
          <resetValue>0xF0F7FFFF</resetValue>
          <fields>
            <field>
              <name>FLASHPWRUPCNT</name>
              <description>Number of successful FLASHPWRUPn read cycles when powering up flash. After chip power up, the NVMC controller reads FLASHPWRUPn for 7 us.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>IFCREADDELAY</name>
              <description>number of cycles before Information Configuration Registers can be read</description>
              <lsb>11</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>WS</name>
              <description>wait-states (excluding the cache controller) for I-Code flash access, D-Code has one more wait-state.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1WS</name>
                  <description>1 wait-state in total for I-Code (2 for D-Code)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2WS</name>
                  <description>2 wait-state in total for I-Code (3 for D-Code)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3WS</name>
                  <description>3 wait-state in total for I-Code (4 for D-Code)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4WS</name>
                  <description>4 wait-state in total for I-Code (5 for D-Code)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5WS</name>
                  <description>5 wait-state in total for I-Code (6 for D-Code)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6WS</name>
                  <description>6 wait-state in total for I-Code (7 for D-Code)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7WS</name>
                  <description>7 wait-state in total for I-Code (8 for D-Code)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8WS</name>
                  <description>8 wait-state in total for I-Code (9 for D-Code)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9WS</name>
                  <description>9 wait-state in total for I-Code (10 for D-Code)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10WS</name>
                  <description>10 wait-state in total for I-Code (11 for D-Code)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11WS</name>
                  <description>11 wait-state in total for I-Code (12 for D-Code)</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12WS</name>
                  <description>12 wait-state in total for I-Code (13 for D-Code)</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13WS</name>
                  <description>13 wait-state in total for I-Code (14 for D-Code)</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14WS</name>
                  <description>14 wait-state in total for I-Code (15 for D-Code)</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15WS</name>
                  <description>15 wait-state in total for I-Code (16 for D-Code)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMPCALIB</name>
              <description>TEMP module calibration value (default value for TEMP-&amp;gt;CALIB)</description>
              <lsb>22</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF03</name>
          <description>Miscellaneous modem HW configuration.</description>
          <addressOffset>0x24C</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFF0</resetValue>
          <fields>
            <field>
              <name>RAMWAITSTATE</name>
              <description>Modem M4 RAM wait state configuration, into a modem secure control register.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF04</name>
          <description>MODEM M4 VMC SRAMTRIM values</description>
          <addressOffset>0x250</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFE8</resetValue>
          <fields>
            <field>
              <name>BTRIM</name>
              <description>Source Bias Trim Adjustment for retention</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>WM</name>
              <description>Write Margin Adjustment</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RM</name>
              <description>Read Margin Adjustment</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RWM</name>
              <description>Read/Write Margin Adjustment</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF05</name>
          <description>MODEM M4 VMC RamSSNonRetTSel timing control values for TSMC RAMs</description>
          <addressOffset>0x254</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFE1</resetValue>
          <fields>
            <field>
              <name>RTSEL</name>
              <description>Read cycle timing selection</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>WTSEL</name>
              <description>Write cycle timing selection</description>
              <lsb>2</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF06</name>
          <description>MODEM DSP SRAMTRIM values</description>
          <addressOffset>0x258</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFE8</resetValue>
          <fields>
            <field>
              <name>BTRIM</name>
              <description>Source Bias Trim Adjustment for retention</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>WM</name>
              <description>Write Margin Adjustment</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RM</name>
              <description>Read Margin Adjustment</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RWM</name>
              <description>Read/Write Margin Adjustment</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF07</name>
          <description>MODEM RF VMC SRAMTRIM values</description>
          <addressOffset>0x25C</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFF88</resetValue>
          <fields>
            <field>
              <name>BTRIM</name>
              <description>Source Bias Trim Adjustment for retention</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>WM</name>
              <description>Write Margin Adjustment</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RM</name>
              <description>Read Margin Adjustment</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RWM</name>
              <description>Read/Write Margin Adjustment</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHPWRUP0</name>
          <description>Power-up pattern for flash</description>
          <addressOffset>0x280</addressOffset>
          <access>read-only</access>
          <resetValue>0xAAAAAAAA</resetValue>
          <fields>
            <field>
              <name>FLASHPWRUP0</name>
              <description>Power-up pattern for flash</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHPWRUP1</name>
          <description>Power-up pattern for flash</description>
          <addressOffset>0x284</addressOffset>
          <access>read-only</access>
          <resetValue>0xAAAAAAAA</resetValue>
          <fields>
            <field>
              <name>FLASHPWRUP1</name>
              <description>Power-up pattern for flash</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PRODTEST[%s]</name>
          <description>Description collection: Production test control n</description>
          <addressOffset>0x800</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PRODTEST</name>
              <description>Production test control (majority vote done for each bit over all three fields to get the used value)</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Done</name>
                  <description>Production tests done</description>
                  <value>0xBB42319F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotDone</name>
                  <description>Production tests not done, SoC is in Virgin mode (with any other value than 0xBB42319F)</description>
                  <value>0xFFFFFFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
