adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UICR_NS</name>
      <description>User Information Configuration Registers</description>
      <baseAddress>0x00FF8000</baseAddress>
      <headerStructName>UICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>UICR</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>APPROTECT</name>
          <description>Access Port protection</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>APPROTECT</name>
              <description>Enable or disable Access Port protection</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Debugger access blocking disabled</description>
                  <value>0xFFFFFFFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Any value diferent to 0xFFFFFFFF will make debugger access
		              blocking enabled</description>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEPROTECT</name>
          <description>Flash erase protection</description>
          <addressOffset>0x004</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>ERASEPROTECT</name>
              <description>Protect against erase all and erase UICR</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Flash not protected against erase all and erase UICR</description>
                  <value>0xFFFFFFFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Any value diferent to 0xFFFFFFFF will make flash protected
		              against erase all and erase UICR</description>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ACLREGION0ADDR</name>
          <description>ACL region0 address. Value will get inverted in the readout process before writing the value to ACL.</description>
          <addressOffset>0x008</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ACL region0 address</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ACLREGION0SIZE</name>
          <description>ACL region0 size. Value will get inverted in the readout process before writing the value to ACL.</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <description>ACL region0 size</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ACLREGION0PERM</name>
          <description>ACL region0 permissions. Value will get inverted in the readout process before writing the value to ACL.</description>
          <addressOffset>0x010</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PERM</name>
              <description>ACL region0 permissions</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ACLREGION1ADDR</name>
          <description>ACL region1 address. Value will get inverted in the readout process before writing the value to ACL.</description>
          <addressOffset>0x014</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ACL region1 address</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ACLREGION1SIZE</name>
          <description>ACL region1 size. Value will get inverted in the readout process before writing the value to ACL.</description>
          <addressOffset>0x018</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <description>ACL region1 size</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ACLREGION1PERM</name>
          <description>ACL region1 permissions. Value will get inverted in the readout process before writing the value to ACL.</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PERM</name>
              <description>ACL region1 permissions</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMNVMCPOFGUARD</name>
          <description>Enable blocking NVM WRITE and aborting NVM ERASE for LTE-Modem NVM in POFWARN condition.</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>NVMCPOFGUARDEN</name>
              <description>Enable blocking NVM WRITE and aborting NVM ERASE in POFWARN condition.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>NVM WRITE and NVM ERASE are not blocked in POFWARN condition.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>NVM WRITE and NVM ERASE are blocked in POFWARN condition.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PKEYREVOKED</name>
          <description>Private key revoked status.</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>REVOKED</name>
              <description>Private key revoked status.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Revoked</name>
                  <description>Private key revoked and not usable anymore.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Valid</name>
                  <description>Private key valid and usable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTBLOCK</name>
          <description>Modem UART RXD TXD blocking.</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>RXDBLOCKING</name>
              <description>RXD input blocking setting</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Blocked</name>
                  <description>RXD blocked, tied low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotBlocked</name>
                  <description>RXD not blocked.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXDBLOCKING</name>
              <description>TXD output blocking setting</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Blocked</name>
                  <description>TXD blocked, tied low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotBlocked</name>
                  <description>TXD not blocked.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSLOT1DEST</name>
          <description>KEYSLOT1 destination address</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DEST</name>
              <description>KEYSLOT1 destination address</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSLOT1CONFIG</name>
          <description>KEYSLOT1 configuration</description>
          <addressOffset>0x404</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>WRITE</name>
              <description>Write permission for key slot {i}</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable write to registers KEYSLOT{i}.VALUE[0-3]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Registers KEYSLOT{i}.VALUE[0-3] can be written</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READ</name>
              <description>Read permission for key slot {i}.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable read from registers KEYSLOT{i}.VALUE[0-3]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Registers KEYSLOT{i}.VALUE[0-3] can be read</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUSH</name>
              <description>Push permission for key slot {i}</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Content of registers KEYSLOT{i}.VALUE[0-3] can not be pushed, but can be read if field READ is 'Enabled'</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Content of registers KEYSLOT{i}.VALUE[0-3] can be pushed over secure APB. Register KEYSLOT{i}.DEST must contain a valid destination address!</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS</name>
              <description>Key status</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Revoked</name>
                  <description>Key revoked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Key active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSLOT1KEYVALUE0</name>
          <description>KEYSLOT1 key bits [31:0]</description>
          <addressOffset>0x800</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>KEYSLOT1 key bits [31:0]</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSLOT1KEYVALUE1</name>
          <description>KEYSLOT1 key bits [63:32]</description>
          <addressOffset>0x804</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>KEYSLOT1 key bits [63:32]</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSLOT1KEYVALUE2</name>
          <description>KEYSLOT1 key bits [95:64]</description>
          <addressOffset>0x808</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>KEYSLOT1 key bits [95:64]</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSLOT1KEYVALUE3</name>
          <description>KEYSLOT1 key bits [127:96]</description>
          <addressOffset>0x80C</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>KEYSLOT1 key bits [127:96]</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
