adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TRACEDELAYREG_NS</name>
      <description>Trace delay register</description>
      <baseAddress>0xD0000000</baseAddress>
      <headerStructName>TRACEDELAYREG</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>TRACEDELAYREG</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>DELAY_REG_CONFIG</name>
          <description>Configuration register for DELAY_REG delay</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DELAY_REG_CONFIG</name>
              <description>Register write delay, configurable between 0 and 31 clock cycles. Delay between apbPEnable and
		apbPReady is adjusted to the configured value, except for the small values, when minimum interconnect
		delay exist.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DELAY_REG</name>
          <description>Dummy register with adjustable write delay. Occupies 0x100 address range i.e. 256bytes</description>
          <addressOffset>0x600</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DELAY_REG</name>
              <description>Dummy register with adjustable write delay</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AMLI_NS</name>
      <description>AHB Multi-Layer Interface</description>
      <baseAddress>0x40000000</baseAddress>
      <headerStructName>AMLI</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>AMLI</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>RAMPRI</name>
          <description>RAM configurable priority configuration structure</description>
          <headerStructName>AMLI_RAMPRI</headerStructName>
          <access>read-write</access>
          <addressOffset>0xE00</addressOffset>
          <register>
            <name>CPU</name>
            <description>AHB bus master priority register for CPU</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>RAM_0</name>
                <description>Priority register for RAM AHB slaves</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x1</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>EXTRAM[%s]</name>
            <description>Description collection: AHB bus master priority register for external RAM slave port (EXTRAMs)</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>RAM_0</name>
                <description>Priority register for RAM AHB slaves</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Pri0</name>
                    <description>Priority 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pri1</name>
                    <description>Priority 1</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>DCNF_NS</name>
      <description>Domain Configuration Management</description>
      <baseAddress>0x40000000</baseAddress>
      <alternatePeripheral>AMLI_NS</alternatePeripheral>
      <headerStructName>DCNF</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>DCNF</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>CPUID</name>
          <description>CPU number in the system</description>
          <addressOffset>0x420</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CPUID</name>
              <description>CPU number in the system</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>EXTPERI0</name>
          <description>Unspecified</description>
          <headerStructName>DCNF_EXTPERI0</headerStructName>
          <access>read-write</access>
          <addressOffset>0x440</addressOffset>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PROTECT[%s]</name>
            <description>Description collection: Control access for  Master connected to AMLI master port EXTPERI[n]</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SLAVE0</name>
                <description>Control access to slave  0 of master EXTPERI[n].</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE1</name>
                <description>Control access to slave  1 of master EXTPERI[n].</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE2</name>
                <description>Control access to slave  2 of master EXTPERI[n].</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE3</name>
                <description>Control access to slave  3 of master EXTPERI[n].</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE4</name>
                <description>Control access to slave  4 of master EXTPERI[n].</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE5</name>
                <description>Control access to slave  5 of master EXTPERI[n].</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE6</name>
                <description>Control access to slave  6 of master EXTPERI[n].</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>EXTRAM</name>
          <description>Unspecified</description>
          <headerStructName>DCNF_EXTRAM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x460</addressOffset>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PROTECT[%s]</name>
            <description>Description collection: Control access from  Master connected to AMLI master port EXTRAM[n]</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SLAVE0</name>
                <description>Control access to slave  0 of master EXTRAM[n].</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE1</name>
                <description>Control access to slave  1 of master EXTRAM[n].</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE2</name>
                <description>Control access to slave  2 of master EXTRAM[n].</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE3</name>
                <description>Control access to slave  3 of master EXTRAM[n].</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE4</name>
                <description>Control access to slave  4 of master EXTRAM[n].</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE5</name>
                <description>Control access to slave  5 of master EXTRAM[n].</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE6</name>
                <description>Control access to slave  6 of master EXTRAM[n].</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE7</name>
                <description>Control access to slave  7 of master EXTRAM[n].</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>EXTCODE[%s]</name>
          <description>Unspecified</description>
          <headerStructName>DCNF_EXTCODE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x480</addressOffset>
          <register>
            <name>PROTECT</name>
            <description>Description cluster: Control access from  Master connected to AMLI master port EXTCODE[n]</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SLAVE0</name>
                <description>Control access to slave  0 of master EXTCODE[n].</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE1</name>
                <description>Control access to slave  1 of master EXTCODE[n].</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE2</name>
                <description>Control access to slave  2 of master EXTCODE[n].</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is possible</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>CSTNUMPRETICKS</name>
          <description>ClockStatusTracker pretick count setting</description>
          <addressOffset>0x488</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>NUMPRETICKS</name>
              <description>Pretick count setting.</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CSTNUMPOSTTICKS</name>
          <description>ClockStatusTracker posttick count setting</description>
          <addressOffset>0x48C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>NUMPOSTTICKS</name>
              <description>Posttick count setting.</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
