adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RAMBISTHUB_NS</name>
      <description>RAM BIST Hub</description>
      <baseAddress>0x4002B000</baseAddress>
      <headerStructName>RAMBISTHUB</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>RAMBISTHUB</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>RUN</name>
          <description>RUN BIST</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RUN</name>
              <description>RUN BIST</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear the task</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Run the task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEEP</name>
          <description>BIST SLEEP EVENT</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SLEEP</name>
              <description>BIST SLEEP EVENT</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoEventDetected</name>
                  <description>No event detected. Write zero to clear the event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EventDetected</name>
                  <description>Event detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FINISHED</name>
          <description>BIST FINISHED EVENT</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FINISHED</name>
              <description>BIST FINISHED EVENT</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoEventDetected</name>
                  <description>No event detected. Write zero to clear the event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EventDetected</name>
                  <description>Event detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HUBENABLE</name>
          <description>RAM BIST Hub enable</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>HUBENABLE</name>
              <description>RAM BIST Hub enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>RAM BIST Hub disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>RAM BIST Hub enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SELECTBIST</name>
          <description>Select bits for the individual BISTs to run</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SELECTBIST0</name>
              <description>Select and enable BIST0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>BIST0 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>BIST0 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELECTBIST1</name>
              <description>Select and enable BIST1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>BIST1 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>BIST1 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELECTBIST2</name>
              <description>Select and enable BIST2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>BIST2 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>BIST2 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BISTSTATUS</name>
          <description>BIST status</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BISTSTATUS0</name>
              <description>Status of BIST0. Write to clear.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotPassed</name>
                  <description>Read: BIST0 not passed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Passed</name>
                  <description>Read: BIST0 passed. Write zero to clear.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BISTSTATUS1</name>
              <description>Status of BIST1. Write to clear.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotPassed</name>
                  <description>Read: BIST1 not passed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Passed</name>
                  <description>Read: BIST1 passed. Write zero to clear.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BISTSTATUS2</name>
              <description>Status of BIST2. Write to clear.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotPassed</name>
                  <description>Read: BIST2 not passed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Passed</name>
                  <description>Read: BIST2 passed. Write zero to clear.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTTYPE</name>
          <description>RAM BIST test type</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TESTTYPE</name>
              <description>RAM BIST Hub enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIST</name>
                  <description>Non-retention BIST</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RetentionBIST</name>
                  <description>Retention BIST</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCEONRETENTION</name>
          <description>Power request override to force RAM retention on</description>
          <addressOffset>0x510</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>FORCEONRETENTION</name>
              <description>Power request override to force RAM retention on</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Power request override disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Power request override enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
