adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TIMEMARKMUX_NS</name>
      <description>Timemark multiplexer for LTE System Timer</description>
      <baseAddress>0x40033000</baseAddress>
      <headerStructName>TIMEMARKMUX</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>TIMEMARKMUX</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>ENABLE</name>
          <description>Enable Timemark Mux</description>
          <addressOffset>0x0500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE_TMRF</name>
              <description>Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable RF timemark output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable RF timemark output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE_TMGNSS</name>
              <description>Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable GNSS timemark output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable GNSS timemark output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEMARK_INPUT_SELECT</name>
          <description>Timemark input select register</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RF_TIMEMARK_SELECT</name>
              <description>RF timemark input select</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Event0</name>
                  <description>Enable events[0] as timemark input</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event1</name>
                  <description>Enable events[1] as timemark input</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event2</name>
                  <description>Enable events[2] as timemark input</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event3</name>
                  <description>Enable events[3] as timemark input</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event4</name>
                  <description>Enable events[4] as timemark input</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event5</name>
                  <description>Enable events[5] as timemark input</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event6</name>
                  <description>Enable events[6] as timemark input</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event7</name>
                  <description>Enable events[7] as timemark input</description>
                  <value>0x80</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GNSS_TIMEMARK_SELECT</name>
              <description>GNSS timemark input select</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Event0</name>
                  <description>Enable events[0] as timemark input</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event1</name>
                  <description>Enable events[1] as timemark input</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event2</name>
                  <description>Enable events[2] as timemark input</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event3</name>
                  <description>Enable events[3] as timemark input</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event4</name>
                  <description>Enable events[4] as timemark input</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event5</name>
                  <description>Enable events[5] as timemark input</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event6</name>
                  <description>Enable events[6] as timemark input</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event7</name>
                  <description>Enable events[7] as timemark input</description>
                  <value>0x80</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
