adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LFCLKCALIBMEAS_NS</name>
      <description>LfClk Calibration Measurement</description>
      <baseAddress>0x4003B000</baseAddress>
      <headerStructName>LFCLKCALIBMEAS</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LFCLKCALIBMEAS</name>
        <value>59</value>
      </interrupt>
      <groupName>LFCLKCALIBMEAS</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Start Measuring</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_START</name>
              <description>Start Measuring</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Switch LfClkCalibMeas to STOPPED state. Brings LfClkCalibMeas from SHUTDOWN state to a configurable state before a measurement is launched.</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STOP</name>
              <description>Switch LfClkCalibMeas to STOPPED state. Brings LfClkCalibMeas from SHUTDOWN state to a configurable state before a measurement is launched.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_SHUTDOWN</name>
          <description>Shut down LfClkCalibMeas</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_SHUTDOWN</name>
              <description>Shut down LfClkCalibMeas</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_COMPLETE</name>
          <description>Measurement completed.</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_COMPLETE</name>
              <description>Measurement completed.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Enable or disable interrupt</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMPLETE</name>
              <description>Enable or disable interrupt for event COMPLETE</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMPLETE</name>
              <description>Write '1' to enable interrupt for event COMPLETE</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMPLETE</name>
              <description>Write '1' to disable interrupt for event COMPLETE</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTPEND</name>
          <description>Pending interrupts</description>
          <addressOffset>0x30C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>COMPLETE</name>
              <description>Read pending status of interrupt for event COMPLETE</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RUNTIME</name>
          <description>Runtime status of the measurement.</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>LRBI</name>
              <description>LastRingBufferIndex</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>LMLC</name>
              <description>lastMeasuredLfCycle</description>
              <lsb>8</lsb>
              <msb>28</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LCMEAS0</name>
          <description>Results of the measurement.</description>
          <addressOffset>0x404</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>LCMEAS</name>
              <description>LfClk Measurement result for the series0.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LCMEAS1</name>
          <description>Results of the measurement.</description>
          <addressOffset>0x408</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>LCMEAS</name>
              <description>LfClk Measurement result for the series1.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LCMEAS2</name>
          <description>Results of the measurement.</description>
          <addressOffset>0x40C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>LCMEAS</name>
              <description>LfClk Measurement results for the series2.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LCMEAS3</name>
          <description>Results of the measurement.</description>
          <addressOffset>0x410</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>LCMEAS</name>
              <description>LfClk Measurement results for the series3.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LCMEAS4</name>
          <description>Results of the measurement.</description>
          <addressOffset>0x414</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>LCMEAS</name>
              <description>LfClk Measurement results for the series4.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LCMEAS5</name>
          <description>Results of the measurement.</description>
          <addressOffset>0x418</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>LCMEAS</name>
              <description>LfClk Measurement results for the series5. Only available, if HW parameter NUM_MEASUREMENTS set to larger than five.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LCMEAS6</name>
          <description>Results of the measurement.</description>
          <addressOffset>0x41C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>LCMEAS</name>
              <description>LfClk Measurement results for the series6. Only available, if HW parameter NUM_MEASUREMENTS set to larger than six.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LCMEAS7</name>
          <description>Results of the measurement.</description>
          <addressOffset>0x420</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>LCMEAS</name>
              <description>LfClk Measurement results for the series7. Only available, if HW parameter NUM_MEASUREMENTS set to larger than seven.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LCMEAS8</name>
          <description>Results of the measurement.</description>
          <addressOffset>0x424</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>LCMEAS</name>
              <description>LfClk Measurement results for the series8. Only available, if HW parameter NUM_MEASUREMENTS set to larger than eight.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LCMEAS9</name>
          <description>Results of the measurement.</description>
          <addressOffset>0x428</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>LCMEAS</name>
              <description>LfClk Measurement results for the series9. Only available, if HW parameter NUM_MEASUREMENTS set to larger than nine.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE</name>
          <description>Current running state of the IP.</description>
          <addressOffset>0x42C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>STATE</name>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHUTDOWN</name>
                  <description>In SHUTDOWN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOPPED</name>
                  <description>In STOPPED.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING</name>
                  <description>In RUNNING.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NA</name>
                  <description>NA.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEASLEN</name>
          <description>Length of the measurement.</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>MEASLEN</name>
              <description>Length of the measurement.</description>
              <lsb>0</lsb>
              <msb>20</msb>
            </field>
          </fields>
        </register>
