adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CTRL_AP_PERI_S</name>
      <description>Control access port</description>
      <baseAddress>0x4003D000</baseAddress>
      <headerStructName>CTRLAPPERI</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CTRLAPPERI</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>MAILBOX</name>
          <description>Unspecified</description>
          <headerStructName>CTRLAPPERI_MAILBOX</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <name>RXDATA</name>
            <description>Data sent from the debugger to the CPU</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RXDATA</name>
                <description>Data received from debugger</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXSTATUS</name>
            <description>Status to indicate if data sent from the debugger to the CPU has been read</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RXSTATUS</name>
                <description>Status of data in register RXDATA</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoDataPending</name>
                    <description>No data pending in register RXDATA</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DataPending</name>
                    <description>Data pending in register RXDATA</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TXDATA</name>
            <description>Data sent from the CPU to the debugger</description>
            <addressOffset>0x80</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>TXDATA</name>
                <description>Data sent to debugger</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXSTATUS</name>
            <description>Status to indicate if data sent from the CPU to the debugger status has been read</description>
            <addressOffset>0x84</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>TXSTATUS</name>
                <description>Status of data in register TXDATA</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoDataPending</name>
                    <description>No data pending in register TXDATA</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DataPending</name>
                    <description>Data pending in register TXDATA</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>ERASEPROTECT</name>
          <description>Unspecified</description>
          <headerStructName>CTRLAPPERI_ERASEPROTECT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>LOCK</name>
            <description>Lock ERASEALL mechanism</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ERASEPROTECTLOCK</name>
                <description>Enable or disable the ERASEALL mechanism</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>ERASEALL can be issued</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>ERASEALL is locked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DISABLE</name>
            <description>Unlock ERASEPROTECT and perform ERASEALL</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>KEY</name>
                <description>Initiate secure erase even though ERASEPROTECT is enabled if KEY fields match</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
