adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem.svd
        <register>
          <name>TESTNCMPINC</name>
          <description>Reads and compares last flash row to complement of TESTDATA128 content. Post-increments TESTCONTROLADDR.</description>
          <addressOffset>0x644</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>DIRECT</name>
              <description>Reads and compares last flash row (direct lines) to the complement of TESTDATA128 content (all bits inverted). Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.SE is high, the read starts by pulsing the SE line low for Tnws. If TESTCONTROLLINES.SE is low, SE remains low for the whole access.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Complement</name>
                  <description>Direct TESTDATA128 content and flash row read are each-other's complement</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotComplement</name>
                  <description>Direct TESTDATA128 content and flash row read are not each-other's complement</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LATCHED</name>
              <description>Reads and compares last flash row (latched lines) to the complement of TESTDATA128 content (all bits inverted). Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.SE is high, the read starts by pulsing the SE line low for Tnws. If TESTCONTROLLINES.SE is low, SE remains low for the whole access.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Complement</name>
                  <description>Latched TESTDATA128 content and flash row read are each-other's complement</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotComplement</name>
                  <description>Latched TESTDATA128 content and flash row read are not each-other's complement</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTCONTROLLINES</name>
          <description>Direct flash test, control lines. Refer to the flash IP test documentation for more details.</description>
          <addressOffset>0x648</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REDEN32</name>
              <description>Control the REDEN(3:2) signal</description>
              <lsb>14</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>LVEN</name>
              <description>Control the LVEN signal</description>
              <lsb>16</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>PDM25</name>
              <description>Control the PDM25 signal</description>
              <lsb>17</lsb>
              <msb>17</msb>
            </field>
            <field>
              <name>REDEN10</name>
              <description>Control the REDEN(1:0) signal</description>
              <lsb>18</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>IFREN1</name>
              <description>Control the IFREN1 signal</description>
              <lsb>20</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>EV</name>
              <description>Control the EV signal</description>
              <lsb>21</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>PV</name>
              <description>Control the PV signal</description>
              <lsb>22</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>XE</name>
              <description>Control the XE signal</description>
              <lsb>23</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>YE</name>
              <description>Control the YE signal</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>SE</name>
              <description>Control the SE signal. This signal is delayed by hardware by Tas, so that it can be written simultaneously to XE and YE</description>
              <lsb>25</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>IFREN</name>
              <description>Control the IFREN signal</description>
              <lsb>26</lsb>
              <msb>26</msb>
            </field>
            <field>
              <name>ERASE</name>
              <description>Control the ERASE signal</description>
              <lsb>27</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>MAS1</name>
              <description>Control the MAS1 signal</description>
              <lsb>28</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>PROG</name>
              <description>Control the PROG signal</description>
              <lsb>29</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>NVSTR</name>
              <description>Control the NVSTR signal</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>TMR</name>
              <description>Control the TMR signal</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTCONTROLADDR</name>
          <description>Direct flash test control, address lines</description>
          <addressOffset>0x64C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YADDR</name>
              <description>Control the YADDR signal</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>XADDR</name>
              <description>Control the XADDR signal</description>
              <lsb>6</lsb>
              <msb>17</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTCOUNTERRELOAD</name>
          <description>Counter reload value, used when counting from SE or YE rising edge to latching of data</description>
          <addressOffset>0x650</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RELOAD</name>
              <description>Counter reload value, in MCU bus cycles, used when counting from SE or YE rising edge to latching of data. Value of 0 has no effect (counter will not latch)</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTCOUNTERRUNNING</name>
          <description>Returns the state (counting or not) of the counter</description>
          <addressOffset>0x654</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUNNING</name>
              <description>Returns the state of the counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotRunning</name>
                  <description>Counter is not running</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Running</name>
                  <description>Counter is running</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTCONFIG</name>
          <description>Mode of operation of the counter</description>
          <addressOffset>0x658</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Returns the state of the counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Counter is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Counter is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START</name>
              <description>Defines the starting point of the counter</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SE</name>
                  <description>Counter starts on SE rising edge</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YE</name>
                  <description>Counter starts on YE rising edge</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOINC</name>
              <description>Controls the address auto-increment or -decrement</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Increment</name>
                  <description>Address is auto-incrementing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Decrement</name>
                  <description>Address is auto-decrementing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOINCEN</name>
              <description>Disables the address auto-increment or -decrement</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Address auto-incrementing/decrementing is disabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Address auto-incrementing/decrementing is enabled</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTTMVPPANAEN</name>
          <description>Controls analog signals for flash measurements</description>
          <addressOffset>0x65C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TMANAEN</name>
              <description>Analog enable for TM measurement. Needs to be set when measuring TM[3:0] on P0.05, P0.04, P0.01 and P0.00.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>All pads disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>All pads enabled</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VPPDIVEN</name>
              <description>Enable the VPPDIV pad. Needs to be set when measuring VPPDIV on GPIO26 (P0.20), and when applying high-voltage on VPP pad.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>VPPDIV pad disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>VPPDIV pad enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCEONNVM</name>
          <description>Force on all NVM supplies. See also the internal section in the NVMC chapter.</description>
          <addressOffset>0x700</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FORCEONNVM</name>
              <description>Force on all NVM supplies. See also the internal section in the NVMC chapter.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DoNotForceOn</name>
                  <description>Do not force on NVM supply</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceOn</name>
                  <description>Force on NVM supply</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCEOFFNVM</name>
          <description>Force off NVM supply. See also the internal section in the NVMC chapter.</description>
          <addressOffset>0x728</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FORCEOFFNVM0</name>
              <description>Force off NVM supply 0. See also the internal section in the NVMC chapter.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DoNotForceOff</name>
                  <description>Do not force off supply.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceOff</name>
                  <description>Force off supply.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEOFFNVM1</name>
              <description>Force off NVM supply 1. See also the internal section in the NVMC chapter.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DoNotForceOff</name>
                  <description>Do not force off supply.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceOff</name>
                  <description>Force off supply.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY</name>
              <description>KEY</description>
              <lsb>8</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>EnableWrite</name>
                  <description>Must be written in order to write to bits 0-7. Any other value will ignore writes to this register. Read as zero.</description>
                  <value>0xACCE55</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
