adamkondraciuk/hal_nordic/nrfx/mdk/nrf9160_modem.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>VMC_NS</name>
      <description>Volatile Memory controller</description>
      <baseAddress>0x40061000</baseAddress>
      <headerStructName>VMC</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>VMC</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x010</dimIncrement>
          <name>RAM[%s]</name>
          <description>Unspecified</description>
          <headerStructName>VMC_RAM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>POWER</name>
            <description>Description cluster: RAMn power control register</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000FFFF</resetValue>
            <fields>
              <field>
                <name>S01POWER</name>
                <description>Unused power control bit</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>UNUSED_POWER1</name>
                <description>Unused power control bit</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>S01RETENTION</name>
                <description>Unused retention control bit</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION1</name>
                <description>Unused retention control bit</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>POWERSET</name>
            <description>Description cluster: RAMn power control set register</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <resetValue>0x0000FFFF</resetValue>
            <fields>
              <field>
                <name>S01POWER</name>
                <description>Unused power control bit</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>UNUSED_POWER1</name>
                <description>Unused power set control bit</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>S01RETENTION</name>
                <description>Unused power control bit</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION1</name>
                <description>Unused retention set control bit</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>POWERCLR</name>
            <description>Description cluster: RAMn power control clear register</description>
            <addressOffset>0x008</addressOffset>
            <access>write-only</access>
            <resetValue>0x0000FFFF</resetValue>
            <fields>
              <field>
                <name>S01POWER</name>
                <description>Unused power control bit</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>UNUSED_POWER1</name>
                <description>Unused power clear control bit</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>S01RETENTION</name>
                <description>Unused power control bit</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION1</name>
                <description>Unused retention clear control bit</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x010</dimIncrement>
          <name>RAMB[%s]</name>
          <description>Unspecified</description>
          <headerStructName>VMC_RAMB</headerStructName>
          <access>read-write</access>
          <addressOffset>0x700</addressOffset>
          <register>
            <name>POWER</name>
            <description>Description cluster: RAM Bn power control register</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000FFFF</resetValue>
            <fields>
              <field>
                <name>S015POWER</name>
                <description>Keep RAM sections S0-S15 of RAM Bn on or off in System ON mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNUSED_POWER0</name>
                <description>Unused power bit 0</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>UNUSED_POWER1</name>
                <description>Unused power bit 1</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>UNUSED_POWER2</name>
                <description>Unused power bit 2</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>UNUSED_POWER3</name>
                <description>Unused power bit 3</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>UNUSED_POWER4</name>
                <description>Unused power bit 4</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>UNUSED_POWER5</name>
                <description>Unused power bit 5</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>UNUSED_POWER6</name>
                <description>Unused power bit 6</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UNUSED_POWER7</name>
                <description>Unused power bit 7</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>UNUSED_POWER8</name>
                <description>Unused power bit 8</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>UNUSED_POWER9</name>
                <description>Unused power bit 9</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>UNUSED_POWER10</name>
                <description>Unused power bit 10</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>UNUSED_POWER11</name>
                <description>Unused power bit 11</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>UNUSED_POWER12</name>
                <description>Unused power bit 12</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>UNUSED_POWER13</name>
                <description>Unused power bit 13</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>UNUSED_POWER14</name>
                <description>Unused power bit 14</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>S015RETENTION</name>
                <description>Keep retention on RAM section S0-S15 of RAM Bn when RAM section is switched off</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNUSED_RETENTION0</name>
                <description>Unused retention bit 0</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION1</name>
                <description>Unused retention bit 1</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION2</name>
                <description>Unused retention bit 2</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION3</name>
                <description>Unused retention bit 3</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION4</name>
                <description>Unused retention bit 4</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION5</name>
                <description>Unused retention bit 5</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION6</name>
                <description>Unused retention bit 6</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION7</name>
                <description>Unused retention bit 7</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION8</name>
                <description>Unused retention bit 8</description>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION9</name>
                <description>Unused retention bit 9</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION10</name>
                <description>Unused retention bit 10</description>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION11</name>
                <description>Unused retention bit 11</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION12</name>
                <description>Unused retention bit 12</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION13</name>
                <description>Unused retention bit 13</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION14</name>
                <description>Unused retention bit 14</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>POWERSET</name>
            <description>Description cluster: RAM Bn power control set register</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <resetValue>0x0000FFFF</resetValue>
            <fields>
              <field>
                <name>S015POWER</name>
                <description>Keep RAM section S0-S15 of RAM Bn on or off in System ON mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNUSED_POWER0</name>
                <description>Unused power set bit 0</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>UNUSED_POWER1</name>
                <description>Unused power set bit 1</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>UNUSED_POWER2</name>
                <description>Unused power set bit 2</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>UNUSED_POWER3</name>
                <description>Unused power set bit 3</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>UNUSED_POWER4</name>
                <description>Unused power set bit 4</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>UNUSED_POWER5</name>
                <description>Unused power set bit 5</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>UNUSED_POWER6</name>
                <description>Unused power set bit 6</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UNUSED_POWER7</name>
                <description>Unused power set bit 7</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>UNUSED_POWER8</name>
                <description>Unused power set bit 8</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>UNUSED_POWER9</name>
                <description>Unused power set bit 9</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>UNUSED_POWER10</name>
                <description>Unused power set bit 10</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>UNUSED_POWER11</name>
                <description>Unused power set bit 11</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>UNUSED_POWER12</name>
                <description>Unused power set bit 12</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>UNUSED_POWER13</name>
                <description>Unused power set bit 13</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>UNUSED_POWER14</name>
                <description>Unused power set bit 14</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>S015RETENTION</name>
                <description>Keep retention on RAM section S0-S15 of RAM Bn when RAM section is switched off</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UNUSED_RETENTION0</name>
                <description>Unused retention set bit 0</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION1</name>
                <description>Unused retention set bit 1</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION2</name>
                <description>Unused retention set bit 2</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION3</name>
                <description>Unused retention set bit 3</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION4</name>
                <description>Unused retention set bit 4</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION5</name>
                <description>Unused retention set bit 5</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION6</name>
                <description>Unused retention set bit 6</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION7</name>
                <description>Unused retention set bit 7</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION8</name>
                <description>Unused retention set bit 8</description>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION9</name>
                <description>Unused retention set bit 9</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION10</name>
                <description>Unused retention set bit 10</description>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION11</name>
                <description>Unused retention set bit 11</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION12</name>
                <description>Unused retention set bit 12</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION13</name>
                <description>Unused retention set bit 13</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>UNUSED_RETENTION14</name>
                <description>Unused retention set bit 14</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
